Revit 2027 API
ElementTypeGroup Enumeration
 The element type group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ElementTypeGroup
Public Enumeration ElementTypeGroup
public enum class ElementTypeGroup
type ElementTypeGroup
Members
Member name | Value | Description
AlignmentStationLabelType | 151 |  The alignment station label type.
AnalyticalLinkType | 136 |  The analytical link type.
AngularDimensionType | 37 |  The angular dimension type.
ArcLengthDimensionType | 38 |  The arc length dimension type.
AreaLoadType | 82 |  The area load type.
AreaReinforcementType | 87 |  Area reinforcement type.
AttachedDetailGroupType | 34 |  The attached detail group type.
BeamSystemType | 54 |  The beam system type.
BendingDetail | 154 |  The bending detail type.
BuildingPadType | 43 |  The building pad type.
CableTrayType | 122 |  The cable tray type.
CableType | 157 |  The electrical cable type.
CalloutType | 22 |  The callout view type.
CeilingType | 6 |  The ceiling type.
ColorFillType | 143 |  The color fill legend type.
ConduitType | 123 |  The conduilt type.
ContourLabelingType | 46 |  The contour labeling type.
CorniceType | 16 |  The cornice type.
CurtainSystemType | 58 |  The curtain system type.
DecalType | 45 |  The decal type.
DetailGroupType | 33 |  The detail group type.
DiameterDimensionType | 126 |  The diameter dimension type.
DuctInsulationType | 120 |  The duct insulation type.
DuctLiningType | 121 |  The duct lining type.
DuctType | 97 |  The duct type.
EdgeSlabType | 50 |  The slab edge type.
EndTreatmentType | 146 |  The End Treatment Type.
FabricAreaType | 90 |  The fabric area type.
FabricSheetType | 91 |  The fabric sheet type.
FasciaType | 48 |  The fascial type.
FilledRegionType | 35 |  The filled region type.
FlexDuctType | 98 |  The flex duct type.
FlexPipeType | 101 |  The flex pipe type.
FloorType | 4 |  The floor type.
FootingSlabType | 5 |  The footing slab type.
GridType | 8 |  The Grid Type.
GutterType | 49 |  The gutter type.
LevelType | 9 |  The Level Type
LinearDimensionType | 10 |  The linear dimension type.
LineLoadType | 83 |  The line load type.
ModelGroupType | 32 |  The model group type.
ModelTextType | 14 |  The model text type.
MultiReferenceAnnotationType | 140 |  The multi-reference annotation type.
PathReinforcementType | 88 |  Path reinforcement type.
PipeInsulationType | 119 |  The pipe insulation type.
PipeType | 100 |  The pipe type.
PointLoadType | 84 |  The point load type.
RadialDimensionType | 36 |  The radial dimension type.
RailingsTypeForRamps | 1 |  The railings type for ramps.
RailingsTypeForStairs | 0 |  The railings type for stairs.
RampType | 28 |  The ramp type.
RebarBarType | 85 |  The rebar bar type.
RebarContainerType | 144 |  The Rebar Container Type.
RebarSpliceType | 156 |  The rebar splice type.
ReferenceViewerType | 21 |  The reference viewer type.
RepeatingDetailType | 53 |  The repeating detail type.
RevealType | 17 |  The reveal type.
RoofSoffitType | 47 |  The roof soffit type.
RoofType | 3 |  The roof type.
SchematicBendingDetail | 155 |  The schematic bending detail type.
SpotCoordinateType | 106 |  The spot coordinate type.
SpotElevationType | 11 |  The spot elevation type.
SpotSlopeType | 108 |  The spot slope type.
StairsBySketchType | 7 |  The stairs by sketch type.
StairsRailingType | 30 |  The stairs railing type.
StairsType | 127 |  The stairs type.
StructuralConnectionHandlerType | 145 |  The Structural Connection Handler Type.
TagNoteType | 13 |  The tag note type.
TextNoteType | 12 |  The text note type.
ViewportType | 19 |  The viewport type.
ViewType3D | 62 |  The 3D view type.
ViewTypeCeilingPlan | 72 |  The ceiling plan view type.
ViewTypeCostReport | 67 |  The cost report view type.
ViewTypeDetailView | 74 |  The detail view type.
ViewTypeDrafting | 69 |  The drafting view type.
ViewTypeElevation | 75 |  The elevation view type.
ViewTypeFloorPlan | 71 |  The floor plan view type.
ViewTypeGraphScheduleColumn | 107 |  The graph schedule column view type.
ViewTypeLegend | 66 |  The legend view type.
ViewTypeLoadsReport | 78 |  The loads report view type.
ViewTypePanelSchedule | 80 |  The panel schedule view type.
ViewTypePressureLossReport | 79 |  The pressure loss report view type.
ViewTypeRendering | 64 |  The rendering view type.
ViewTypeSchedule | 65 |  The schedule view type.
ViewTypeSection | 73 |  The section view type.
ViewTypeSheet | 68 |  The sheet view type.
ViewTypeStructuralElevation | 76 |  The structrual elevation view type.
ViewTypeStructuralPlan | 70 |  The structural plan view type.
ViewTypeSystemsAnalysisReport | 150 |  The system analysis report view type.
ViewTypeWalkthrough | 63 |  The walkthrough view type.
WallFoundationType | 109 |  The wall foundation type.
WallType | 2 |  The wall type.
WireType | 102 |  The wire type.
See Also
Reference
Autodesk.Revit.DB Namespace